In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [6]:
data = pd.read_csv(r'C:\Users\adina\Downloads\StudentsPerformance.csv')

In [8]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [10]:
#1
gen_counts = data['gender'].value_counts()

In [12]:
gen_counts

female    518
male      482
Name: gender, dtype: int64

In [14]:
print('No.of males participated is', gen_counts['male'])
print('No.of males participated is', gen_counts['female'])

No.of males participated is 482
No.of males participated is 518

In [16]:
#2
parental_education_counts = data["parental level of education"].value_counts()

In [18]:
parental_education_counts

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [20]:
#3
scores_by_gender = data.groupby(['gender', 'test preparation course']).mean()[['math score', 'reading score', 'writing score']]

C:\Users\adina\AppData\Local\Temp\ipykernel_22816\1107780588.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  scores_by_gender = data.groupby(['gender', 'test preparation course']).mean()[['math score', 'reading score', 'writing score']]

In [22]:
scores_by_gender

                                math score  reading score  writing score
gender test preparation course
female completed                 67.108696      77.375000      78.793478
       none                      61.320359      69.955090      68.982036
male   completed                 72.988506      70.793103      70.339080
       none                      66.467532      62.581169      59.551948

In [24]:
#4
variation_by_gender = data.groupby('gender').var()[['math score', 'reading score', 'writing score']]
variation_by_test_prep = data.groupby('test preparation course').var()[['math score', 'reading score', 'writing score']]

C:\Users\adina\AppData\Local\Temp\ipykernel_22816\2067712083.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.var is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  variation_by_gender = data.groupby('gender').var()[['math score', 'reading score', 'writing score']]
C:\Users\adina\AppData\Local\Temp\ipykernel_22816\2067712083.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.var is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  variation_by_test_prep = data.groupby('test preparation course').var()[['math score', 'reading score', 'writing score']]

In [27]:
variation_by_gender

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [29]:
variation_by_test_prep

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [34]:
#5
sorted_data = data.sort_values(by='math score', ascending=False)

In [35]:
sorted_data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
2,female,group B,some high school,free/reduced,none,18,32,28
51,female,group C,some high school,free/reduced,none,13,41,51
3,female,group B,some college,standard,none,11,38,32
1,female,group B,high school,free/reduced,none,8,24,23
0,female,group C,some high school,free/reduced,none,0,17,10

In [39]:
cutoff_score = sorted_data['math score'].quantile(0.75)

In [41]:
cutoff_score

77.0

In [43]:
top_students = sorted_data[sorted_data['math score'] >= cutoff_score]

In [45]:
top_students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
...,...,...,...,...,...,...,...,...
851,male,group D,some college,standard,completed,77,62,62
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
421,female,group C,some college,free/reduced,none,77,90,91
414,female,group A,high school,free/reduced,completed,77,88,85

In [50]:
bonus_points = 5
top_students['math score'] += bonus_points

C:\Users\adina\AppData\Local\Temp\ipykernel_22816\3544715532.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  top_students['math score'] += bonus_points

In [51]:
print(top_students[['math score', 'reading score', 'writing score']])

     math score  reading score  writing score
999         110            100            100
996         110             96             86
515         110             92             97
517         110            100            100
516         110            100            100
..          ...            ...            ...
851          87             62             62
849          87             67             68
850          87             67             64
421          87             90             91
414          87             88             85

[255 rows x 3 columns]